src/Documents/ИС_WB_СборочноеЗадание.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ИС_WB_СборочноеЗадание</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>article</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>convertedPrice</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>deliveryType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>isLargeCargo</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДоставки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_ВБ_ТипыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>orderUid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>price</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>rid</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаПродажи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fullAddress</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>fio</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>phone</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>longitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>latitude</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВВалютеУчета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДобавочныеКоды</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>address</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>province</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>area</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>city</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>street</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>home</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>flat</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>entrance</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>longitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>latitude</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>offices</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>prioritySc</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>skus</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>user</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>fio</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>phone</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СоответствиеРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СоответствиеРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РазмерWB</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Упаковка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_ШтрихкодыРазмеров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_ШтрихкодыРазмеров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_РазмерыНоменклатур</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Поставка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_ВБ_ПоставкиFBS</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданий</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусWB</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИС_WB_СтатусыСборочныхЗаданийВСистемеWildBerries</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>partB</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>barcode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Этикетка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДоставкиПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИС_WB_Профили</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СборочноеЗадание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИС_WB_СборочноеЗадание</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ИС_МП_Маркетплейсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ИС_МП_Маркетплейсы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Озон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЯМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сбер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Али</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВМ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ламода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сервис</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/ИС_WB_СборочноеЗадание/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

#Область Печать

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт	 
	// ПФ с количеством и разбиением
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ИС_ЭтикеткиСКоличеством";
	КомандаПечати.Представление = НСтр("ru = 'Этикетки и штрихкоды с разбиением'");
	КомандаПечати.МенеджерПечати = "Документ.ИС_WB_СборочноеЗадание";
	КомандаПечати.Картинка = БиблиотекаКартинок.ИС_MP_QR_ШК;

	Возврат;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - Массив - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати - СписокЗначений - значение - ссылка на объект;
//                                            представление - имя области, в которой был выведен объект (выходной параметр);
//  ПараметрыВывода - Структура - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
    
    Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ИС_ЭтикеткиСКоличеством") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ИС_ЭтикеткиСКоличеством",
			НСтр("ru = 'Этикетки и штрихкоды WildBerries с разбиением'"),
			СформироватьПечатнуюФормуЭтикеткиСКоличеством(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;

КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
Функция СформироватьПечатнуюФормуЭтикеткиСКоличеством(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент; 
	ТабличныйДокумент.АвтоМасштаб = Истина;
    ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ИС_ЭтикеткиСКоличеством";
    
    МакетСостав = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_СоставСборки58x40");
    МакетQR = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_QR58х40");
    МакетЭтикетка = УправлениеПечатью.МакетПечатнойФормы("Документ.ИС_WB_СборочноеЗадание.ПФ_MXL_ШтрихкодТовара58х40");
   	Эталон = УправлениеПечатью.МакетПечатнойФормы("ОбщийМакет.ИС_МП_Эталон"); 
	КоличествоМиллиметровВПикселе = Эталон.Рисунки.Квадрат100Пикселей.Высота / 100; 
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить("КоличествоСоставов");
	МассивПараметров.Добавить("КоличествоЭтикеток");   
	МассивПараметров.Добавить("КоличествоШтрихкодов");
	
	Профиль = МассивОбъектов[0].Профиль;
	Маркетплейс = Перечисления.ИС_МП_Маркетплейсы.ВБ; 
	
	НастройкиПечати = ИС_МП_Сервер.ПолучитьЗначениеНастроек(Профиль, Маркетплейс, МассивПараметров);
	
	Если НастройкиПечати["КоличествоСоставов"] = Неопределено Тогда
		НастройкиПечати.КоличествоСоставов = 1;	
	КонецЕсли;
	
	Если НастройкиПечати["КоличествоЭтикеток"] = Неопределено Тогда
		НастройкиПечати.КоличествоЭтикеток = 1;	
	КонецЕсли;
	
	Если НастройкиПечати["КоличествоШтрихкодов"] = Неопределено Тогда
		НастройкиПечати.КоличествоШтрихкодов = 2;	
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИС_WB_СборочноеЗадание.Ссылка КАК Ссылка,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode КАК НоменклатураWBvendorCode,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование КАК НоменклатураWBНаименование,
	|	ИС_WB_СборочноеЗадание.РазмерWB КАК РазмерWB,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация КАК ПрофильОрганизация,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация.ИНН КАК ПрофильОрганизацияИНН,
	|	МАКСИМУМ(ИС_WB_ШтрихкодыРазмеров.Штрихкод) КАК Штрихкод,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Наименование КАК НаименованиеН,
	|	ИС_WB_СборочноеЗадание.ТипДоставки КАК ТипДоставки
	|ПОМЕСТИТЬ ВТ_ДанныеСборочныхЗаданий
	|ИЗ
	|	Документ.ИС_WB_СборочноеЗадание КАК ИС_WB_СборочноеЗадание
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СоответствиеРазмеров КАК ИС_WB_СоответствиеРазмеров
	|		ПО ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_СоответствиеРазмеров.РазмерWB
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_ШтрихкодыРазмеров КАК ИС_WB_ШтрихкодыРазмеров
	|		ПО ИС_WB_СборочноеЗадание.РазмерWB = ИС_WB_ШтрихкодыРазмеров.Размер
	|ГДЕ
	|	ИС_WB_СборочноеЗадание.Ссылка В(&Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ИС_WB_СборочноеЗадание.Ссылка,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.vendorCode,
	|	ИС_WB_СборочноеЗадание.НоменклатураWB.Наименование,
	|	ИС_WB_СборочноеЗадание.РазмерWB,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация,
	|	ИС_WB_СборочноеЗадание.Профиль.Организация.ИНН,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Наименование,
	|	ИС_WB_СоответствиеРазмеров.Номенклатура.Артикул,
	|	ИС_WB_СборочноеЗадание.ТипДоставки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеСборочныхЗаданий.Ссылка КАК Ссылка,
	|	ВТ_ДанныеСборочныхЗаданий.НоменклатураWBvendorCode КАК Артикул,
	|	ВТ_ДанныеСборочныхЗаданий.НоменклатураWBНаименование КАК Наименование,
	|	ВТ_ДанныеСборочныхЗаданий.РазмерWB КАК РазмерWB,
	|	ВТ_ДанныеСборочныхЗаданий.ПрофильОрганизация КАК Организация,
	|	ВТ_ДанныеСборочныхЗаданий.ПрофильОрганизацияИНН КАК ИНН,
	|	ВТ_ДанныеСборочныхЗаданий.Штрихкод КАК Штрихкод,
	|	ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.Этикетка КАК Этикетка,
	|	ВТ_ДанныеСборочныхЗаданий.НаименованиеН КАК НаименованиеН,
	|	ВТ_ДанныеСборочныхЗаданий.ТипДоставки КАК ТипДоставки
	|ИЗ
	|	ВТ_ДанныеСборочныхЗаданий КАК ВТ_ДанныеСборочныхЗаданий
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий КАК ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий
	|		ПО ВТ_ДанныеСборочныхЗаданий.Ссылка = ИС_WB_СтатусыИЭтикеткиСборочныхЗаданий.СборочноеЗадание
	|
	|УПОРЯДОЧИТЬ ПО
	|	Наименование
	|ИТОГИ ПО
	|	РазмерWB";

	Запрос.УстановитьПараметр("Ссылка", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаРазмерWB = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Пока ВыборкаРазмерWB.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
				
		Выборка = ВыборкаРазмерWB.Выбрать();
		
        ПерваяЭтикета = Истина;
		
		Пока Выборка.Следующий() Цикл
			
           	Если ПерваяЭтикета Тогда
           	    
           	 	Количество = Выборка.Количество();
           	    Если Количество > 4 И Количество < 21 Тогда
           	    	Сколенение = "ов";
           	    ИначеЕсли Количество % 10 = 1 Тогда
           	    	Склонение = "з";
           	    ИначеЕсли Количество % 10 > 1 И Количество % 10 < 5 Тогда
           	    	Сколнение = "а";
           	    Иначе
           	    	Сколенение = "ов";
           	    КонецЕсли; 
           	    
           	    МакетСостав.Параметры.Количество = СтрШаблон("по 1 товару в заказе (%1 шт. заказ%2)", Количество, Сколенение);
           		МакетСостав.Параметры.Наименование = Выборка.Наименование;
           		МакетСостав.Параметры.Артикул = Выборка.Артикул;

				Для Сч = 1 По НастройкиПечати.КоличествоСоставов Цикл				
					ТабличныйДокумент.Вывести(МакетСостав);
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
				КонецЦикла;
		
				ПерваяЭтикета = Ложь;
			
			КонецЕсли;
			
			Если Выборка.ТипДоставки <> Перечисления.ИС_ВБ_ТипыДоставки.CnC Тогда
			
				МакетQR.Рисунки.КартинкаQR.Картинка = Новый Картинка(Выборка.Этикетка.Получить());
				
				Для Сч = 1 По НастройкиПечати.КоличествоЭтикеток Цикл
					ТабличныйДокумент.Вывести(МакетQR);
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Выборка.Сбросить();
		
		Пока Выборка.Следующий() Цикл
		
			МакетЭтикетка.Параметры.Наименование  = Выборка.НаименованиеН;
		    МакетЭтикетка.Параметры.Артикул = Выборка.Артикул;
			МакетЭтикетка.Параметры.Поставщик = СтрШаблон("%1 ИНН %2", Выборка.Организация, Выборка.ИНН);
	        
			ПараметрыШК = ИС_MP_ГенерацияШтрихкода.ПараметрыГенерацииШтрихкода();
				        								
			ПараметрыШК.Ширина = Окр(МакетЭтикетка.Рисунки.Штрихкод.Ширина / КоличествоМиллиметровВПикселе);
			ПараметрыШК.Высота = Окр(МакетЭтикетка.Рисунки.Штрихкод.Высота / КоличествоМиллиметровВПикселе);
			ПараметрыШК.РазмерШрифта = 10;
			ПараметрыШК.Штрихкод = Выборка.Штрихкод;
			ПараметрыШК.Масштабировать = Истина;
			ПараметрыШК.СохранятьПропорции = Истина;
			ПараметрыШК.ВертикальноеВыравнивание = 2; 
			
			СтруктураКартинки = ИС_MP_ГенерацияШтрихкода.ИзображениеШтрихкода(ПараметрыШК);		
			
			Если СтруктураКартинки.Результат Тогда	
				МакетЭтикетка.Рисунки.Штрихкод.Картинка = СтруктураКартинки.Картинка;
			КонецЕсли; 
			
			Для Счетчик = 1 По НастройкиПечати.КоличествоШтрихкодов  Цикл
				ТабличныйДокумент.Вывести(МакетЭтикетка);	
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();	
			КонецЦикла;		
		
		КонецЦикла;
	
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
    
КонецФункции //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

#КонецОбласти

#Область Отчеты

//+ ИнфоСофт Ивонин К.А. 22.08.24 УА #80374
// Определяет список команд отчетов.
//
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - Таблица с командами отчетов. Для изменения.
//       См. описание 1 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//   Параметры - Структура - Вспомогательные параметры. Для чтения.
//       См. описание 2 параметра процедуры ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов().
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт
	
	КомандаОтчет = Отчеты.ИС_WB_ЛистПодбора.ДобавитьКомандуОтчета(КомандыОтчетов);
	Если КомандаОтчет <> Неопределено Тогда
		КомандаОтчет.ВидимостьВФормах = "ФормаСписка";
	КонецЕсли;
	
КонецПроцедуры //- ИнфоСофт Ивонин К.А. 22.08.24 УА #80374

#КонецОбласти

#КонецОбласти

#КонецЕсли
